Dlubal.RFEM5.ConnectionOfTwoMembers
Connection of two members parameters

Dlubal.RFEM5.ConnectionOfTwoMembers.No
Number

Dlubal.RFEM5.ConnectionOfTwoMembers.ID
Identifier

Dlubal.RFEM5.ConnectionOfTwoMembers.Comment
Comment

Dlubal.RFEM5.ConnectionOfTwoMembers.Tag
Tag

Dlubal.RFEM5.ConnectionOfTwoMembers.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.ConnectionOfTwoMembers.MainMemberNo
Main member number

Dlubal.RFEM5.ConnectionOfTwoMembers.MainMemberSide
Main member side

Dlubal.RFEM5.ConnectionOfTwoMembers.MainMemberEccentricityNo
Main member eccentricity number

Dlubal.RFEM5.ConnectionOfTwoMembers.MainMemberHingeNo
Member hinge on main rigid member

Dlubal.RFEM5.ConnectionOfTwoMembers.ConnectedMemberNo
Connected member number

Dlubal.RFEM5.ConnectionOfTwoMembers.ConnectedMemberSide
Connected member side

Dlubal.RFEM5.ConnectionOfTwoMembers.ConnectedMemberEccentricityNo
Connected member eccentricity number

Dlubal.RFEM5.ConnectionOfTwoMembers.ConnectedMemberHingeNo
Member hinge on connected rigid member

Dlubal.RFEM5.ConnectionOfTwoMembers.UnlockConnectedMember
Unlock connected member

Dlubal.RFEM5.ConnectionOfTwoMembers.Deactivate
Deactivate

Dlubal.RFEM5.ConnectionOfTwoMembers.GeneratedNodes
List of generated nodes of type 'On Line'

Dlubal.RFEM5.ConnectionOfTwoMembers.GeneratedMembers
List of generated members